In [2]:
import pandas as pd
import numpy as np

#### Exercise

Create a Data Frame using a dictionary, and change the index to letters.

In [9]:
family = {"Names": ["Jose María", "Ignacio", "Alejandro", "Eduardo", "Javier", "Carlos", "María", "Álvaro", "Juan"], 
          "Age": [39, 38, 36, 34, 33, 30, 28, 26, 24]}

In [10]:
family

{'Age': [39, 38, 36, 34, 33, 30, 28, 26, 24],
 'Names': ['Jose María',
  'Ignacio',
  'Alejandro',
  'Eduardo',
  'Javier',
  'Carlos',
  'María',
  'Álvaro',
  'Juan']}

In [11]:
df = pd.DataFrame(family)
df

   Age       Names
0   39  Jose María
1   38     Ignacio
2   36   Alejandro
3   34     Eduardo
4   33      Javier
5   30      Carlos
6   28       María
7   26      Álvaro
8   24        Juan

In [23]:
df.index = list("abcdefghi")

In [24]:
df

   Age       Names
a   39  Jose María
b   38     Ignacio
c   36   Alejandro
d   34     Eduardo
e   33      Javier
f   30      Carlos
g   28       María
h   26      Álvaro
i   24        Juan

#### Exercise

Create a new column and new row in the previous Data Frame.
Try also to create a new column with boolean values

In [25]:
df["City_of_residence"] = ["San Sebastián", "Pamplona", "Pamplona", "León", "Bilbao", "Madrid", "Sevilla", "Madrid", "San Sebastián"]

In [27]:
df.loc["j"] = [66, "Mili", "Madrid"]

In [29]:
df["Mask_Madrid"] = df["City_of_residence"] == "Madrid"

In [30]:
df

   Age       Names City_of_residence  Mask_Madrid
a   39  Jose María     San Sebastián        False
b   38     Ignacio          Pamplona        False
c   36   Alejandro          Pamplona        False
d   34     Eduardo              León        False
e   33      Javier            Bilbao        False
f   30      Carlos            Madrid         True
g   28       María           Sevilla        False
h   26      Álvaro            Madrid         True
i   24        Juan     San Sebastián        False
j   66        Mili            Madrid         True

#### Exercise

Then remove this new column and row

In [34]:
df.drop("Mask_Madrid", axis = 1, inplace = True)
df

   Age       Names City_of_residence
a   39  Jose María     San Sebastián
b   38     Ignacio          Pamplona
c   36   Alejandro          Pamplona
d   34     Eduardo              León
e   33      Javier            Bilbao
f   30      Carlos            Madrid
g   28       María           Sevilla
h   26      Álvaro            Madrid
i   24        Juan     San Sebastián
j   66        Mili            Madrid

#### Exercise

Given the following Data Frame:

    df1 = pd.DataFrame(np.random.randn(4,3) * 17 + 15, columns=list('bde'), index=list('BMPZ'))
    
- Use a lambda function to calculate the difference between max and min per column and per row
- Use a lambda function to calculate the 10% for each item in the Data Frame
- Use a function in order to return a table with the max and min per column
- Use a function to change the format of the numbers to only 2 decimals
- Sort the Data Frame according to the values of the first column

In [35]:
df1 = pd.DataFrame(np.random.randn(4,3) * 17 + 15, columns=list('bde'), index=list('BMPZ'))

In [36]:
df1

           b          d          e
B  -8.063377  32.443240   7.600698
M  -8.541936  21.144879  -6.219979
P -28.713074   0.473972  31.184309
Z   2.144917  12.679873  72.793313

In [38]:
df1.apply(lambda series: max(series) - min(series))

b    30.857991
d    31.969268
e    79.013292
dtype: float64

In [40]:
df1.apply(lambda rows: max(rows) - min(rows), axis = 1)

B    40.506617
M    29.686815
P    59.897383
Z    70.648396
dtype: float64

In [41]:
df1.applymap(lambda x: x / 100)

          b         d         e
B -0.080634  0.324432  0.076007
M -0.085419  0.211449 -0.062200
P -0.287131  0.004740  0.311843
Z  0.021449  0.126799  0.727933

In [47]:
def max_and_min(series):
    return pd.Series([series.max(), series.min()], index = ["max", "min"])

df1.apply(max_and_min)

             b          d          e
max   2.144917  32.443240  72.793313
min -28.713074   0.473972  -6.219979

#### Exercise

Write a function that takes a Series and returns the top 10% registers. In this case, earners. Test it with this Series:

```python
salaries = pd.Series([150000, 90000, 120000,30000,10000,5000,40000, 50000, 80000, 35000, 27000,14000, 28000, 22000,25000])
```

In [48]:
salaries = pd.Series([150000, 90000, 120000, 30000, 10000, 5000, 40000, 50000, 80000, 35000, 27000, 14000, 28000, 22000, 25000])

In [49]:
salaries

0     150000
1      90000
2     120000
3      30000
4      10000
5       5000
6      40000
7      50000
8      80000
9      35000
10     27000
11     14000
12     28000
13     22000
14     25000
dtype: int64

In [59]:
salaries[salaries.rank(ascending = False) < (salaries.count() * 10/100)]

0    150000
dtype: int64

#### Exercise

Given the following Data Frame:

    x = pd.Series([1.2, np.nan, 4, np.nan, 9], index=list('abcde'))
    y = pd.Series([5, 3, 7, np.nan, 14], index=list('abcde'))
    df = pd.DataFrame([x, y], index=['x','y']).T
    
- Sum the values per column and per row taking and not taking into account NaN
- Calculate the mean per column and per row

#### Exercise

Given the following Data Frame:

    array = np.random.randn(8,3) * 20 + 100

    df6 = pd.DataFrame(array, columns=list('xyz'), index=list('abcdefgh'))
    df6.iloc[2:5, 1] = np.nan
    df6.iloc[1:3, 2] = np.nan
                       
- Return the Data Frame with NO NaN per column and per row
- Return the Data Frame with one or less NaN per row. And same per column
- Change the values of the NaN with:
    - Zero
    - Mean per column
- Change the Data Frame removing the NaN